app/controllers/apps_controller.rb

SELECT "apps".* FROM "apps" WHERE "apps"."user_id" = ? LIMIT 30 OFFSET 0  [["user_id", 3]]
---
  def index

    @title = "所有的Apps"
    @user = current_user
    @apps = @user.apps.paginate(page: params[:page])

UPDATE "apps" SET "description" = ?, "updated_at" = ? WHERE "apps"."id" = 1  [["description", "我是一个app, hahahha"], ["updated_at", Thu, 02 Jan 2014 03:13:45 UTC +00:00]]
---
  def update


    respond_to do |format|
      if @app.update(app_params)

SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "app_versions".* FROM "app_versions" WHERE "app_versions"."app_id" = 1 LIMIT 1
SELECT "navgations".* FROM "navgations" WHERE "navgations"."app_id" = 1 LIMIT 1
SELECT "blocks".* FROM "blocks" INNER JOIN "block_types" ON "block_types"."id" = "blocks"."block_type_id" WHERE "blocks"."app_id" = 1
---
  def show
    @user = current_user
    @app = App.find(params[:id])
    @app_version = AppVersion.find_by_app_id(@app.id)
    @navgations = Navgation.find_by_app_id(@app.id)

    @blocks = Block.where(:app_id =>@app.id).joins(:block_type)

SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @user = current_user
    @app = App.find(params[:id])

SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_app
    logger.info(params)
    @app = App.find(params[:id])