app/controllers/nav_types_controller.rb

  def index
    @nav_types = NavType.all
---
SELECT "nav_types".* FROM "nav_types"